# ExessiveBeltDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..ExessiveBeltDistance Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
The requested Measurement Line Offset would place the put the Measurement Line of the face boundaries.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExessiveBeltDistance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExessiveBeltDistance As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExessiveBeltDistance {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace